Revit 2027 API
UIControlledApplication.GetDockablePane Method
Gets a DockablePane object by its ID.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePane GetDockablePane(
	DockablePaneId id
)
Public Function GetDockablePane (
	id As DockablePaneId
) As DockablePane
public:
DockablePane^ GetDockablePane(
	DockablePaneId^ id
)
member GetDockablePane :
        id : DockablePaneId -> DockablePane
Parameters
id DockablePaneId
Unique identifier for the new pane.
Return Value
DockablePane
Exceptions
Exception | Condition
ArgumentException | Thrown if no dockable pane has been registered with identifier %id%.
ArgumentException | Thrown if the dockable pane with identifier %id% has not been created yet.
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace